<template>
  <a-modal title="叮当用户入驻协议" :bodyStyle="{ padding: 0 }" :width="960" :height="634" on-ok="handleOk">
    <template slot="footer">
      <div class="btn-box">
        <a-button class="btn" type="primary" size="large" html-type="submit"> 同意并继续 15s </a-button>
      </div>
    </template>
    <div class="content" style="height: 350px">
      <p class="title">一、注册协议条款的确认和接受</p>
      <p class="message">
        文都/文都网(以下亦称“本网站”)同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务(以下称“网络服务”)。为获得网络服务,
        申请人应当认真阅读、充分理解本《协议》中各条款,
        包括免除或者限制文都责任的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》(未成年人应在法定监护人陪同下阅读)。同意接受本协议的全部条款的,
        申请人应当按照页面上的提示完成全部的注册程序, 并在注册程序过程中点击“同意”按钮,
        否则视为不接受本《协议》全部条款, 申请人应当终止并退出申请。本《协议》可由文都定期更新,
        更新后的协议条款一旦公布即代替原来的协议条款, 恕不再另行通知,
        用户可在文都查阅最新版协议条款。在文都修改《协议》条款后, 如果用户不接受修改后的条款,
        请立即停止使用文都提供的网络服务, 继续使用的用户将被视为已接受了修改后的协议。
      </p>
      <p class="title">一、注册协议条款的确认和接受</p>
      <p class="message">
        文都/文都网(以下亦称“本网站”)同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务(以下称“网络服务”)。为获得网络服务,
        申请人应当认真阅读、充分理解本《协议》中各条款,
        包括免除或者限制文都责任的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》(未成年人应在法定监护人陪同下阅读)。同意接受本协议的全部条款的,
        申请人应当按照页面上的提示完成全部的注册程序, 并在注册程序过程中点击“同意”按钮,
        否则视为不接受本《协议》全部条款, 申请人应当终止并退出申请。本《协议》可由文都定期更新,
        更新后的协议条款一旦公布即代替原来的协议条款, 恕不再另行通知,
        用户可在文都查阅最新版协议条款。在文都修改《协议》条款后, 如果用户不接受修改后的条款,
        请立即停止使用文都提供的网络服务, 继续使用的用户将被视为已接受了修改后的协议。
      </p>
      <p class="title">一、注册协议条款的确认和接受</p>
      <p class="message">
        文都/文都网(以下亦称“本网站”)同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务(以下称“网络服务”)。为获得网络服务,
        申请人应当认真阅读、充分理解本《协议》中各条款,
        包括免除或者限制文都责任的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》(未成年人应在法定监护人陪同下阅读)。同意接受本协议的全部条款的,
        申请人应当按照页面上的提示完成全部的注册程序, 并在注册程序过程中点击“同意”按钮,
        否则视为不接受本《协议》全部条款, 申请人应当终止并退出申请。本《协议》可由文都定期更新,
        更新后的协议条款一旦公布即代替原来的协议条款, 恕不再另行通知,
        用户可在文都查阅最新版协议条款。在文都修改《协议》条款后, 如果用户不接受修改后的条款,
        请立即停止使用文都提供的网络服务, 继续使用的用户将被视为已接受了修改后的协议。
      </p>
      <p class="title">一、注册协议条款的确认和接受</p>
      <p class="message">
        文都/文都网(以下亦称“本网站”)同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务(以下称“网络服务”)。为获得网络服务,
        申请人应当认真阅读、充分理解本《协议》中各条款,
        包括免除或者限制文都责任的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》(未成年人应在法定监护人陪同下阅读)。同意接受本协议的全部条款的,
        申请人应当按照页面上的提示完成全部的注册程序, 并在注册程序过程中点击“同意”按钮,
        否则视为不接受本《协议》全部条款, 申请人应当终止并退出申请。本《协议》可由文都定期更新,
        更新后的协议条款一旦公布即代替原来的协议条款, 恕不再另行通知,
        用户可在文都查阅最新版协议条款。在文都修改《协议》条款后, 如果用户不接受修改后的条款,
        请立即停止使用文都提供的网络服务, 继续使用的用户将被视为已接受了修改后的协议。
      </p>
      <p class="title">一、注册协议条款的确认和接受</p>
      <p class="message">
        文都/文都网(以下亦称“本网站”)同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务(以下称“网络服务”)。为获得网络服务,
        申请人应当认真阅读、充分理解本《协议》中各条款,
        包括免除或者限制文都责任的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》(未成年人应在法定监护人陪同下阅读)。同意接受本协议的全部条款的,
        申请人应当按照页面上的提示完成全部的注册程序, 并在注册程序过程中点击“同意”按钮,
        否则视为不接受本《协议》全部条款, 申请人应当终止并退出申请。本《协议》可由文都定期更新,
        更新后的协议条款一旦公布即代替原来的协议条款, 恕不再另行通知,
        用户可在文都查阅最新版协议条款。在文都修改《协议》条款后, 如果用户不接受修改后的条款,
        请立即停止使用文都提供的网络服务, 继续使用的用户将被视为已接受了修改后的协议。
      </p>
      <p class="title">一、注册协议条款的确认和接受</p>
      <p class="message">
        文都/文都网(以下亦称“本网站”)同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务(以下称“网络服务”)。为获得网络服务,
        申请人应当认真阅读、充分理解本《协议》中各条款,
        包括免除或者限制文都责任的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》(未成年人应在法定监护人陪同下阅读)。同意接受本协议的全部条款的,
        申请人应当按照页面上的提示完成全部的注册程序, 并在注册程序过程中点击“同意”按钮,
        否则视为不接受本《协议》全部条款, 申请人应当终止并退出申请。本《协议》可由文都定期更新,
        更新后的协议条款一旦公布即代替原来的协议条款, 恕不再另行通知,
        用户可在文都查阅最新版协议条款。在文都修改《协议》条款后, 如果用户不接受修改后的条款,
        请立即停止使用文都提供的网络服务, 继续使用的用户将被视为已接受了修改后的协议。
      </p>
      <p class="title">一、注册协议条款的确认和接受</p>
      <p class="message">
        文都/文都网(以下亦称“本网站”)同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务(以下称“网络服务”)。为获得网络服务,
        申请人应当认真阅读、充分理解本《协议》中各条款,
        包括免除或者限制文都责任的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》(未成年人应在法定监护人陪同下阅读)。同意接受本协议的全部条款的,
        申请人应当按照页面上的提示完成全部的注册程序, 并在注册程序过程中点击“同意”按钮,
        否则视为不接受本《协议》全部条款, 申请人应当终止并退出申请。本《协议》可由文都定期更新,
        更新后的协议条款一旦公布即代替原来的协议条款, 恕不再另行通知,
        用户可在文都查阅最新版协议条款。在文都修改《协议》条款后, 如果用户不接受修改后的条款,
        请立即停止使用文都提供的网络服务, 继续使用的用户将被视为已接受了修改后的协议。
      </p>
      <p class="title">一、注册协议条款的确认和接受</p>
      <p class="message">
        文都/文都网(以下亦称“本网站”)同意按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务(以下称“网络服务”)。为获得网络服务,
        申请人应当认真阅读、充分理解本《协议》中各条款,
        包括免除或者限制文都责任的免责条款及对用户的权利限制条款。审慎阅读并选择接受或不接受本《协议》(未成年人应在法定监护人陪同下阅读)。同意接受本协议的全部条款的,
        申请人应当按照页面上的提示完成全部的注册程序, 并在注册程序过程中点击“同意”按钮,
        否则视为不接受本《协议》全部条款, 申请人应当终止并退出申请。本《协议》可由文都定期更新,
        更新后的协议条款一旦公布即代替原来的协议条款, 恕不再另行通知,
        用户可在文都查阅最新版协议条款。在文都修改《协议》条款后, 如果用户不接受修改后的条款,
        请立即停止使用文都提供的网络服务, 继续使用的用户将被视为已接受了修改后的协议。
      </p>
    </div>
  </a-modal>
</template>

<script>
export default {
  data() {
    return {}
  }
}
</script>

<style>
</style>
